PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f67j94.inc
;----- LCDDATA63 Bits -----------------------------------------------------
S56C7            EQU  H'0000'
S57C7            EQU  H'0001'
S58C7            EQU  H'0002'
S59C7            EQU  H'0003'
S60C7            EQU  H'0004'
S61C7            EQU  H'0005'
S62C7            EQU  H'0006'
S63C7            EQU  H'0007'


;----- LCDSE0 Bits -----------------------------------------------------
SE00             EQU  H'0000'
SE01             EQU  H'0001'
SE02             EQU  H'0002'
SE03             EQU  H'0003'
SE04             EQU  H'0004'
SE05             EQU  H'0005'
SE06             EQU  H'0006'
SE07             EQU  H'0007'


;----- LCDSE1 Bits -----------------------------------------------------
SE08             EQU  H'0000'
SE09             EQU  H'0001'
SE10             EQU  H'0002'
SE11             EQU  H'0003'
SE12             EQU  H'0004'
SE13             EQU  H'0005'
SE14             EQU  H'0006'
SE15             EQU  H'0007'


;----- LCDSE2 Bits -----------------------------------------------------
SE16             EQU  H'0000'
SE17             EQU  H'0001'
SE18             EQU  H'0002'
SE19             EQU  H'0003'
SE20             EQU  H'0004'
SE21             EQU  H'0005'
SE22             EQU  H'0006'
SE23             EQU  H'0007'


;----- LCDSE3 Bits -----------------------------------------------------
SE24             EQU  H'0000'
SE25             EQU  H'0001'
SE26             EQU  H'0002'
SE27             EQU  H'0003'
SE28             EQU  H'0004'
SE29             EQU  H'0005'
SE30             EQU  H'0006'
SE31             EQU  H'0007'


;----- LCDSE4 Bits -----------------------------------------------------
SE32             EQU  H'0000'
SE33             EQU  H'0001'
SE34             EQU  H'0002'
SE35             EQU  H'0003'
SE36             EQU  H'0004'
SE37             EQU  H'0005'
SE38             EQU  H'0006'
SE39             EQU  H'0007'


;----- LCDSE5 Bits -----------------------------------------------------
SE40             EQU  H'0000'
SE41             EQU  H'0001'
SE42             EQU  H'0002'
SE43             EQU  H'0003'
SE44             EQU  H'0004'
SE45             EQU  H'0005'
SE46             EQU  H'0006'
SE47             EQU  H'0007'


;----- LCDSE6 Bits -----------------------------------------------------
SE48             EQU  H'0000'
SE49             EQU  H'0001'
SE50             EQU  H'0002'
SE51             EQU  H'0003'
SE52             EQU  H'0004'
SE53             EQU  H'0005'
SE54             EQU  H'0006'
SE55             EQU  H'0007'


;----- LCDSE7 Bits -----------------------------------------------------
SE56             EQU  H'0000'
SE57             EQU  H'0001'
SE58             EQU  H'0002'
SE59             EQU  H'0003'
SE60             EQU  H'0004'
SE61             EQU  H'0005'
SE62             EQU  H'0006'
SE63             EQU  H'0007'


;----- LCDRL Bits -----------------------------------------------------
LRLAT0           EQU  H'0000'
LRLAT1           EQU  H'0001'
LRLAT2           EQU  H'0002'
LRLBP0           EQU  H'0004'
LRLBP1           EQU  H'0005'
LRLAP0           EQU  H'0006'
LRLAP1           EQU  H'0007'


;----- LCDREF Bits -----------------------------------------------------
VLCD1PE          EQU  H'0000'
VLCD2PE          EQU  H'0001'
VLCD3PE          EQU  H'0002'
LCDIRE           EQU  H'0007'

LCDCST0          EQU  H'0003'
LCDCST1          EQU  H'0004'
LCDCST2          EQU  H'0005'


;----- LCDREG Bits -----------------------------------------------------
MODE13           EQU  H'0002'
CPEN             EQU  H'0007'

CLKSEL0          EQU  H'0000'
CLKSEL1          EQU  H'0001'
BIAS0            EQU  H'0003'
BIAS1            EQU  H'0004'
BIAS2            EQU  H'0005'


;----- LCDCON Bits -----------------------------------------------------
WERR             EQU  H'0005'
SLPEN            EQU  H'0006'
LCDEN            EQU  H'0007'

LMUX0            EQU  H'0000'
LMUX1            EQU  H'0001'
LMUX2            EQU  H'0002'
CS0              EQU  H'0003'
CS1              EQU  H'0004'


;----- LCDPS Bits -----------------------------------------------------
WA               EQU  H'0004'
LCDA             EQU  H'0005'
BIASMD           EQU  H'0006'
WFT              EQU  H'0007'

LP0              EQU  H'0000'
LP1              EQU  H'0001'
LP2              EQU  H'0002'
LP3              EQU  H'0003'


;----- REFO2CON3 Bits -----------------------------------------------------
RODIV8           EQU  H'0000'
RODIV9           EQU  H'0001'
RODIV10          EQU  H'0002'
RODIV11          EQU  H'0003'
RODIV12          EQU  H'0004'
RODIV13          EQU  H'0005'
RODIV14          EQU  H'0006'


;----- REFO2CON2 Bits -----------------------------------------------------
RODIV0           EQU  H'0000'
RODIV1           EQU  H'0001'
RODIV2           EQU  H'0002'
RODIV3           EQU  H'0003'
RODIV4           EQU  H'0004'
RODIV5           EQU  H'0005'
RODIV6           EQU  H'0006'
RODIV7           EQU  H'0007'


;----- REFO2CON1 Bits -----------------------------------------------------
ROSEL0           EQU  H'0000'
ROSEL1           EQU  H'0001'
ROSEL2           EQU  H'0002'
ROSEL3           EQU  H'0003'


;----- REFO2CON Bits -----------------------------------------------------
ACTIVE           EQU  H'0000'
DIVSWEN          EQU  H'0001'
ROSSLP           EQU  H'0003'
ROOE             EQU  H'0004'
ROSIDL           EQU  H'0005'
ROON             EQU  H'0007'


;----- REFO1CON3 Bits -----------------------------------------------------
RODIV8           EQU  H'0000'
RODIV9           EQU  H'0001'
RODIV10          EQU  H'0002'
RODIV11          EQU  H'0003'
RODIV12          EQU  H'0004'
RODIV13          EQU  H'0005'
RODIV14          EQU  H'0006'


;----- REFO1CON2 Bits -----------------------------------------------------
RODIV0           EQU  H'0000'
RODIV1           EQU  H'0001'
RODIV2           EQU  H'0002'
RODIV3           EQU  H'0003'
RODIV4           EQU  H'0004'
RODIV5           EQU  H'0005'
RODIV6           EQU  H'0006'
RODIV7           EQU  H'0007'


;----- REFO1CON1 Bits -----------------------------------------------------
ROSEL0           EQU  H'0000'
ROSEL1           EQU  H'0001'
ROSEL2           EQU  H'0002'
ROSEL3           EQU  H'0003'


;----- REFO1CON Bits -----------------------------------------------------
ACTIVE           EQU  H'0000'
DIVSWEN          EQU  H'0001'
ROSSLP           EQU  H'0003'
ROOE             EQU  H'0004'
ROSIDL           EQU  H'0005'
ROON             EQU  H'0007'


;----- ODCON2 Bits -----------------------------------------------------
ECCP3OD          EQU  H'0000'
CCP4OD           EQU  H'0001'
CCP5OD           EQU  H'0002'
CCP6OD           EQU  H'0003'
CCP7OD           EQU  H'0004'
CCP8OD           EQU  H'0005'
CCP9OD           EQU  H'0006'
CCP10OD          EQU  H'0007'


;----- ODCON1 Bits -----------------------------------------------------
SSP1OD           EQU  H'0000'
SSP2OD           EQU  H'0001'
USART1OD         EQU  H'0002'
USART2OD         EQU  H'0003'
USART3OD         EQU  H'0004'
USART4OD         EQU  H'0005'
ECCP1OD          EQU  H'0006'
ECCP2OD          EQU  H'0007'


;----- MDCARL Bits -----------------------------------------------------
MDCLSYNC         EQU  H'0005'
MDCLPOL          EQU  H'0006'
MDCLODIS         EQU  H'0007'

MDCL0            EQU  H'0000'
MDCL1            EQU  H'0001'
MDCL2            EQU  H'0002'
MDCL3            EQU  H'0003'


;----- MDCARH Bits -----------------------------------------------------
MDCHSYNC         EQU  H'0005'
MDCHPOL          EQU  H'0006'
MDCHODIS         EQU  H'0007'

MDCH0            EQU  H'0000'
MDCH1            EQU  H'0001'
MDCH2            EQU  H'0002'
MDCH3            EQU  H'0003'


;----- MDSRC Bits -----------------------------------------------------
MDSODIS          EQU  H'0007'

MDSRC0           EQU  H'0000'
MDSRC1           EQU  H'0001'
MDSRC2           EQU  H'0002'
MDSRC3           EQU  H'0003'


;----- MDCON Bits -----------------------------------------------------
MDBIT            EQU  H'0000'
MDO              EQU  H'0003'
MDOPOL           EQU  H'0004'
MDSLR            EQU  H'0005'
MDOE             EQU  H'0006'
MDEN             EQU  H'0007'


;----- PMD4 Bits -----------------------------------------------------
EMBMD            EQU  H'0000'
LVDMD            EQU  H'0002'
IOCMD            EQU  H'0003'
USBMD            EQU  H'0004'
CMP3MD           EQU  H'0005'
CMP2MD           EQU  H'0006'
CMP1MD           EQU  H'0007'


