PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f67j94.inc
CCH0             EQU  H'0000'
CCH1             EQU  H'0001'
EVPOL0           EQU  H'0003'
EVPOL1           EQU  H'0004'


;----- PADCFG1 Bits -----------------------------------------------------
RLPU             EQU  H'0000'
RKPU             EQU  H'0001'
RJPU             EQU  H'0002'
RHPU             EQU  H'0003'
RGPU             EQU  H'0004'
RFPU             EQU  H'0005'
REPU             EQU  H'0006'
RDPU             EQU  H'0007'


;----- IOCN Bits -----------------------------------------------------
IOCN0            EQU  H'0000'
IOCN1            EQU  H'0001'
IOCN2            EQU  H'0002'
IOCN3            EQU  H'0003'
IOCN4            EQU  H'0004'
IOCN5            EQU  H'0005'
IOCN6            EQU  H'0006'
IOCN7            EQU  H'0007'


;----- IOCP Bits -----------------------------------------------------
IOCP0            EQU  H'0000'
IOCP1            EQU  H'0001'
IOCP2            EQU  H'0002'
IOCP3            EQU  H'0003'
IOCP4            EQU  H'0004'
IOCP5            EQU  H'0005'
IOCP6            EQU  H'0006'
IOCP7            EQU  H'0007'


;----- RTCCON2 Bits -----------------------------------------------------
PWCSPRE          EQU  H'0004'
PWCCPRE          EQU  H'0005'
PWCPOL           EQU  H'0006'
PWCEN            EQU  H'0007'

RTCSECSEL0       EQU  H'0000'
RTCSECSEL1       EQU  H'0001'
RTCCLKSEL0       EQU  H'0002'
RTCCLKSEL1       EQU  H'0003'


;----- ALRMRPT Bits -----------------------------------------------------
ARPT0            EQU  H'0000'
ARPT1            EQU  H'0001'
ARPT2            EQU  H'0002'
ARPT3            EQU  H'0003'
ARPT4            EQU  H'0004'
ARPT5            EQU  H'0005'
ARPT6            EQU  H'0006'
ARPT7            EQU  H'0007'


;----- ALRMCFG Bits -----------------------------------------------------
CHIME            EQU  H'0006'
ALRMEN           EQU  H'0007'

ALRMPTR0         EQU  H'0000'
ALRMPTR1         EQU  H'0001'
AMASK0           EQU  H'0002'
AMASK1           EQU  H'0003'
AMASK2           EQU  H'0004'
AMASK3           EQU  H'0005'


;----- RTCCAL Bits -----------------------------------------------------
CAL0             EQU  H'0000'
CAL1             EQU  H'0001'
CAL2             EQU  H'0002'
CAL3             EQU  H'0003'
CAL4             EQU  H'0004'
CAL5             EQU  H'0005'
CAL6             EQU  H'0006'
CAL7             EQU  H'0007'


;----- RTCCON1 Bits -----------------------------------------------------
RTCOE            EQU  H'0002'
HALFSEC          EQU  H'0003'
RTCSYNC          EQU  H'0004'
RTCWREN          EQU  H'0005'
RTCEN            EQU  H'0007'

RTCPTR0          EQU  H'0000'
RTCPTR1          EQU  H'0001'


;----- DMACON1 Bits -----------------------------------------------------
DMAEN            EQU  H'0000'
DLYINTEN         EQU  H'0001'
RXINC            EQU  H'0004'
TXINC            EQU  H'0005'

DUPLEX0          EQU  H'0002'
DUPLEX1          EQU  H'0003'
SSCON0           EQU  H'0006'
SSCON1           EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
CMP1IE           EQU  H'0000'
CMP2IE           EQU  H'0001'
CMP3IE           EQU  H'0002'
TX3IE            EQU  H'0004'
RC3IE            EQU  H'0005'
TX4IE            EQU  H'0006'
RC4IE            EQU  H'0007'


;----- WPUB Bits -----------------------------------------------------
WPUB0            EQU  H'0000'
WPUB1            EQU  H'0001'
WPUB2            EQU  H'0002'
WPUB3            EQU  H'0003'
WPUB4            EQU  H'0004'
WPUB5            EQU  H'0005'
WPUB6            EQU  H'0006'
WPUB7            EQU  H'0007'


;----- ACTCON Bits -----------------------------------------------------
ACTORSPOL        EQU  H'0000'
ACTORS           EQU  H'0001'
ACTLOCKPOL       EQU  H'0002'
ACTLOCK          EQU  H'0003'
ACTSRC           EQU  H'0004'
ACTSIDL          EQU  H'0005'
ACTEN            EQU  H'0007'


;----- OSCCON4 Bits -----------------------------------------------------
PLLEN            EQU  H'0005'

CPDIV0           EQU  H'0006'
CPDIV1           EQU  H'0007'


;----- OSCCON3 Bits -----------------------------------------------------
IRCF0            EQU  H'0000'
IRCF1            EQU  H'0001'
IRCF2            EQU  H'0002'


;----- OSCCON2 Bits -----------------------------------------------------
SOSCGO           EQU  H'0001'
POSCEN           EQU  H'0002'
CF               EQU  H'0003'
LOCK             EQU  H'0005'
IOLOCK           EQU  H'0006'
CLKLOCK          EQU  H'0007'


;----- BAUDCON Bits -----------------------------------------------------
ABDEN            EQU  H'0000'
WUE              EQU  H'0001'
IREN             EQU  H'0002'
BRG16            EQU  H'0003'
TXCKP            EQU  H'0004'
RXDTP            EQU  H'0005'
RCIDL            EQU  H'0006'
ABDOVF           EQU  H'0007'

CKTXP            EQU  H'0004'
DTRXP            EQU  H'0005'

SCKP             EQU  H'0004'
RCMT             EQU  H'0006'


;----- BAUDCON1 Bits -----------------------------------------------------
ABDEN            EQU  H'0000'
WUE              EQU  H'0001'
IREN             EQU  H'0002'
BRG16            EQU  H'0003'
TXCKP            EQU  H'0004'
RXDTP            EQU  H'0005'
RCIDL            EQU  H'0006'
ABDOVF           EQU  H'0007'

CKTXP            EQU  H'0004'
DTRXP            EQU  H'0005'

SCKP             EQU  H'0004'
RCMT             EQU  H'0006'


;----- SSP1MSK Bits -----------------------------------------------------
MSK0             EQU  H'0000'
MSK1             EQU  H'0001'
MSK2             EQU  H'0002'
MSK3             EQU  H'0003'
MSK4             EQU  H'0004'
MSK5             EQU  H'0005'
MSK6             EQU  H'0006'
MSK7             EQU  H'0007'


;----- SSP1CON3 Bits -----------------------------------------------------
DHEN             EQU  H'0000'
AHEN             EQU  H'0001'
SBCDE            EQU  H'0002'
SDAHT            EQU  H'0003'
BOEN             EQU  H'0004'
SCIE             EQU  H'0005'
PCIE             EQU  H'0006'
ACKTIM           EQU  H'0007'


;----- TXBUF Bits -----------------------------------------------------
TXBUF0           EQU  H'0000'
TXBUF1           EQU  H'0001'
TXBUF2           EQU  H'0002'
TXBUF3           EQU  H'0003'
TXBUF4           EQU  H'0004'
TXBUF5           EQU  H'0005'
TXBUF6           EQU  H'0006'
TXBUF7           EQU  H'0007'


;----- DMABCH Bits -----------------------------------------------------
BC8              EQU  H'0000'
BC9              EQU  H'0001'


