PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f67j94.inc
;     WDTPS = 128          1:128
;     WDTPS = 256          1:256
;     WDTPS = 512          1:512
;     WDTPS = 1024         1:1024
;     WDTPS = 2048         1:2048
;     WDTPS = 4096         1:4096
;     WDTPS = 8192         1:8192
;     WDTPS = 16384        1:16384
;     WDTPS = 32768        1:32768
;
;   Watchdog Timer Enable:
;     WDTEN = OFF          WDT disabled in hardware; SWDTEN bit disabled
;     WDTEN = NOSLP        WDT enabled only while device is active and disabled in Sleep mode; SWDTEN bit disabled
;     WDTEN = ON           WDT controlled by SWDTEN bit setting
;     WDTEN = SWDTDIS      WDT enabled in hardware; SWDTEN bit disabled
;
;   Windowed Watchdog Timer Disable:
;     WINDIS = WDTWIN      Windowed WDT enabled
;     WINDIS = WDTSTD      Standard WDT selected; windowed WDT disabled
;
;   WDT Prescaler:
;     WPSA = 32            WDT prescaler ratio of 1:32
;     WPSA = 128           WDT prescaler ratio of 1:128
;
;   Retention Voltage Regulator Control Enable:
;     RETEN = ON           Retention controlled by SRETEN during Sleep
;     RETEN = OFF          Retention not available
;
;   VBAT BOR Enable:
;     VBTBOR = OFF         VBAT BOR is disabled
;     VBTBOR = ON          VBAT BOR is enabled
;
;   Deep Sleep BOR Enable:
;     DSBOREN = OFF        BOR disabled in Deep Sleep (does not affect operation in non-Deep Sleep modes)
;     DSBOREN = ON         BOR enabled in Deep Sleep
;
;   DSEN Bit Enable bit:
;     DSBITEN = OFF        Deep Sleep operation is always disabled
;     DSBITEN = ON         Deep Sleep is controlled by the register bit DSEN
;
;   Deep Sleep Watchdog Timer Postscale Select:
;     DSWDTPS = DSWDTPS0   1:32 (1 mS)
;     DSWDTPS = DSWDTPS1   1:64 (2.1 mS)
;     DSWDTPS = DSWDTPS2   1:128 (4.1 mS)
;     DSWDTPS = DSWDTPS3   1: 256 (8.3 mS)
;     DSWDTPS = DSWDTPS4   1:512 (16.5 mS)
;     DSWDTPS = DSWDTPS5   1:1024 (33 mS)
;     DSWDTPS = DSWDTPS6   1:2048 (66.1 mS)
;     DSWDTPS = DSWDTPS7   1:4096 (132.1 mS)
;     DSWDTPS = DSWDTPS8   1:8192 (264.3 mS)
;     DSWDTPS = DSWDTPS9   1:16384 (528.5 mS)
;     DSWDTPS = DSWDTPSA   1:32768 (1.057 Secs)
;     DSWDTPS = DSWDTPSB   1:65536 (2.114 Secs)
;     DSWDTPS = DSWDTPSC   1:131072 (4.228 Secs)
;     DSWDTPS = DSWDTPSD   1:262114 (8.456 Secs)
;     DSWDTPS = DSWDTPSE   1:524288 (16.912 Secs)
;     DSWDTPS = DSWDTPSF   1:1048576 (33.825 Secs)
;     DSWDTPS = DSWDTPS10  1:2097152 (67.7 Secs)
;     DSWDTPS = DSWDTPS11  1:4194304 (135.3 Secs)
;     DSWDTPS = DSWDTPS12  1:8388608 (4.5 Minutes)
;     DSWDTPS = DSWDTPS13  1:16777216 (9 Minutes)
;     DSWDTPS = DSWDTPS14  1:33554432 (18 Minutes)
;     DSWDTPS = DSWDTPS15  1:67108864 (36.1 Minutes)
;     DSWDTPS = DSWDTPS16  1:134217728 (72.2 Minutes)
;     DSWDTPS = DSWDTPS17  1:268435456 (2.4 Hours)
;     DSWDTPS = DSWDTPS18  1:536870912 (4.8 Hours)
;     DSWDTPS = DSWDTPS19  1:1073741824 (9.6 Hours)
;     DSWDTPS = DSWDTPS1A  1:2147483648 (19.2 Hours)
;     DSWDTPS = DSWDTPS1B  1:4294967296 (38.5 Hours)
;     DSWDTPS = DSWDTPS1C  1:8589934592 (77 Hours)
;     DSWDTPS = DSWDTPS1D  1:17179869184 (6.4 Days)
;     DSWDTPS = DSWDTPS1E  1:34359738368 (12.8  Days)
;     DSWDTPS = DSWDTPS1F  1:68719476736 (25.7 Days)
;
;   Deep Sleep Watchdog Timer Enable:
;     DSWDTEN = OFF        DSWDT Disabled
;     DSWDTEN = ON         DSWDT Enabled
;
;   DSWDT Reference Clock Select:
;     DSWDTOSC = SOSC      DSWDT uses SOSC as reference clock
;     DSWDTOSC = LPRC      DSWDT uses LPRC as reference clock
;
;==========================================================================
;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'


        LIST
